imskriaz/IoT/firmware/espidf/esp32-s3-a7670e/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_UNIFIED_TASK_REGISTRY_CAPACITY=24
CONFIG_UNIFIED_HEALTH_MODULE_CAPACITY=32
CONFIG_UNIFIED_TASK_STACK_SMALL=4096
CONFIG_UNIFIED_TASK_STACK_MEDIUM=8192
CONFIG_UNIFIED_TASK_STACK_LARGE=8192
CONFIG_UNIFIED_TASK_STACK_XLARGE=12288
CONFIG_UNIFIED_HEALTH_INTERVAL_MS=5000
CONFIG_UNIFIED_DIAGNOSTICS_INTERVAL_MS=5000
CONFIG_UNIFIED_STORAGE_RECORD_CAPACITY=32
CONFIG_UNIFIED_STORAGE_MOUNT_RETRY_MS=15000
CONFIG_UNIFIED_STORAGE_TASK_STACK_SIZE=16384
CONFIG_UNIFIED_STORAGE_MAX_OPEN_FILES=8
CONFIG_UNIFIED_WIFI_DISABLE_POWER_SAVE=y
CONFIG_UNIFIED_MODEM_UART_PORT=1
CONFIG_UNIFIED_MODEM_UART_BAUD_RATE=115200
CONFIG_UNIFIED_MODEM_UART_RX_BUFFER=4096
CONFIG_UNIFIED_MODEM_AT_TIMEOUT_MS=3000
CONFIG_UNIFIED_MODEM_PROBE_INTERVAL_MS=5000
CONFIG_UNIFIED_AUTOMATION_QUEUE_DEPTH=16
